app/Filament/Widgets/StatsOverview.php

    protected function getCards(): array
    {
        return [
            Card::make('Nouvelle Commandes', Order::where('status', 'new')->get()->count())->chart((new OrderService())->getArray(''))->color('primary'),
            Card::make('Nouveaux Clients', Customer::count())->chart((new CustomerService())->allPerMonth())->color('success'),
        ];
---
select * from `orders` where `status` = 'new' and `orders`.`deleted_at` is null
select count(*) as aggregate from `customers` where `customers`.`deleted_at` is null