app/Filament/Resources/OrderResource/Widgets/OrdersOverview.php

    protected function getCards(): array
    {
        return [
            Card::make('Commandes', Order::where('status', 'new')->get()->count())->chart((new OrderService())->mapOrders()),
            Card::make('Nouvelle Commandes', Order::where('status', 'new')->get()->count())->chart((new OrderService())->mapNewOrders())->color('success'),
            Card::make('Expedié', Order::where('status', 'shipped')->get()->count()),
            Card::make('Livrée', Order::where('status', 'delivered')->get()->count()),
        ];
---
select * from `orders` where `status` = 'delivered' and `orders`.`deleted_at` is null
select * from `orders` where `status` = 'new' and `orders`.`deleted_at` is null
select * from `orders` where `status` = 'shipped' and `orders`.`deleted_at` is null