app/Http/Controllers/PageController.php

    public function productDetails(Category $category, Product $product)
    {

        return view('pages.product-details', [
            'product' => $product,
            'category' => $category,
            'otherProducts' => $category->products()->has('variations')->with('category', 'variations')->get(),
            'categories' => Category::all()
        ]);
---
select * from `categories` where `categories`.`id` in (4) and `categories`.`deleted_at` is null
select * from `products` where `products`.`category_id` = 4 and `products`.`category_id` is not null and `id` != 2 and exists (select * from `variations` where `products`.`id` = `variations`.`product_id`) and `products`.`deleted_at` is null
select * from `variations` where `variations`.`product_id` in (1, 3, 4)